package org.helloworld.kodesource;

public class Task9 {
    public static void main(String[] args) {
        //Напишите программу на Java для вычисления указанных выражений и распечатки вывода.(25,5 * 3,5 - 3,5 * 3,5) / (40,5 - 4,5)
        System.out.println((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5));
    }
}
