package org.helloworld.kodesource;

public class Task1 {
    public static void main(String[] args) {
        /*Напишите программу на Java, которая напечатает «Hello» на экране,
     а затем напечатайте свое имя в отдельной строке.*/
        System.out.println("Hello");
        System.out.println("Ziynat");
    }
}
