package org.helloworld.kodesource;

public class Task8 {
    public static void main(String[] args) {
        /* Напишите программу на Java для отображения следующего шаблона.Образец шаблона:
  J    a    v   v   a
J J  ааааа   v v  ааааа
JJ  a     a   v  a     a  */
        System.out.println("  J    a    v   v   a");
        System.out.println("J J  ааааа   v v  ааааа");
        System.out.println("JJ  a     a   v  a     a");
    }
}
