package codewars;

import java.util.ArrayList;

public class ArrayListSort {
    //вот у тебя функция, что-то типа void sort(X list)
    //пусть она первый элемент с последним местами меняет
    //и пусть она работает для массивов и для листов
    //а ничего другое в неё передать не должен позволить компилятор
    //это довольно не тривиальная задача, и потребуется сопутствующий код
    //но решаемо
    //ну, типа
    //sort(new int[]{1, 2, 3}); // Compiled OK
    //sort(Arrays.asList(1, 2, 3)); // Compiled OK
    //sort(1); // Compilation failure
    //sort(new HashMap()); // Compilation failure
    //имей в виду, это не особо тривиальная проблема
    //если ты раньше такого не видела, придумать будет сложно)
    //но всё необходимое ты уже знаешь
    //у любого массива есть один единственный предок - Object
    //так что частью одной иерархии массивы и листы можно сказать не являются)
    void sort(ArrayList list){

    }
}
